## Production: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                        |
|----------|---------------------------------------------------|
| update   | `module.rds_cluster.aws_security_group.rds_proxy` |
| recreate | `aws_secretsmanager_secret_version.database_host` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_secretsmanager_secret_version.database_host must be replaced
-/+ resource "aws_secretsmanager_secret_version" "database_host" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR|71B378A2-C111-48C8-92B7-26F745FACF47" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "71B378A2-C111-48C8-92B7-26F745FACF47" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.rds_cluster.aws_security_group.rds_proxy will be updated in-place
  ~ resource "aws_security_group" "rds_proxy" {
        id                     = "sg-03f4f613cd728faf0"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 3306
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = []
              - description      = "Client VPN ingress to the database"
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0d61efb4e9ab60608",
                ]
              - self             = false
              - to_port          = 3306
            },
          + {
              + cidr_blocks      = []
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 3306
            },
        ]
        name                   = "wordpress_rds_proxy_sg"
        tags                   = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress_rds_proxy_sg"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ database_host_secret_arn         = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.enable_audit_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.enable_audit_logging_v8"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_host"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_name"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_password"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_username"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
